app/Http/Controllers/PostController.php

    public function index()
    {
        $allposts = Post::all();
        $users = User::all();
---
select * from `posts`
select * from `users`